{"class_name": "Tokenizer", "config": {"num_words": 8000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 1600, "word_counts": "{\"for\": 511, \"this\": 340, \"gate\": 509, \"produces\": 74, \"logic\": 865, \"1\": 1618, \"only\": 271, \"when\": 455, \"all\": 66, \"inputs\": 347, \"are\": 349, \"0\": 305, \"same\": 39, \"level\": 39, \"as\": 232, \"input\": 658, \"high\": 707, \"used\": 77, \"parity\": 33, \"checking\": 33, \"circuits\": 366, \"true\": 800, \"both\": 317, \"and\": 302, \"combos\": 35, \"it\": 140, \"behaves\": 80, \"a\": 419, \"logical\": 121, \"multiplication\": 45, \"practically\": 322, \"if\": 394, \"is\": 976, \"output\": 709, \"in\": 649, \"digital\": 333, \"neither\": 36, \"differ\": 40, \"otherwise\": 34, \"outputs\": 48, \"match\": 48, \"the\": 780, \"equal\": 35, \"acts\": 113, \"equality\": 25, \"detector\": 45, \"b\": 245, \"inverse\": 128, \"of\": 250, \"boolean\": 316, \"gives\": 58, \"performs\": 100, \"negated\": 62, \"or\": 143, \"operation\": 62, \"passes\": 40, \"directly\": 40, \"to\": 143, \"except\": 33, \"flips\": 43, \"state\": 43, \"requires\": 28, \"produce\": 28, \"strengthen\": 44, \"weak\": 44, \"signals\": 44, \"without\": 44, \"change\": 84, \"returns\": 83, \"negation\": 41, \"single\": 68, \"any\": 42, \"at\": 32, \"least\": 32, \"one\": 107, \"result\": 29, \"low\": 60, \"becomes\": 66, \"exactly\": 47, \"either\": 35, \"inversion\": 38, \"signal\": 75, \"universal\": 31, \"generating\": 31, \"others\": 31, \"more\": 28, \"an\": 37, \"identity\": 37, \"addition\": 35, \"equals\": 40, \"no\": 40, \"must\": 31, \"be\": 62, \"xor\": 24, \"inequality\": 20}", "word_docs": "{\"when\": 455, \"are\": 349, \"logic\": 725, \"for\": 470, \"0\": 187, \"produces\": 74, \"1\": 1036, \"this\": 340, \"all\": 66, \"gate\": 470, \"only\": 271, \"inputs\": 347, \"level\": 39, \"as\": 232, \"high\": 533, \"input\": 580, \"same\": 39, \"checking\": 33, \"circuits\": 360, \"parity\": 33, \"used\": 77, \"both\": 317, \"true\": 587, \"and\": 302, \"combos\": 35, \"logical\": 121, \"multiplication\": 45, \"a\": 391, \"it\": 140, \"behaves\": 80, \"if\": 315, \"output\": 664, \"is\": 691, \"practically\": 322, \"digital\": 333, \"neither\": 36, \"in\": 649, \"differ\": 40, \"otherwise\": 34, \"match\": 48, \"outputs\": 48, \"the\": 697, \"equal\": 35, \"acts\": 113, \"detector\": 45, \"equality\": 25, \"b\": 245, \"inverse\": 128, \"of\": 250, \"gives\": 58, \"boolean\": 316, \"performs\": 100, \"operation\": 62, \"negated\": 62, \"or\": 115, \"to\": 143, \"passes\": 40, \"directly\": 40, \"except\": 33, \"state\": 43, \"flips\": 43, \"produce\": 28, \"requires\": 28, \"without\": 44, \"strengthen\": 44, \"change\": 84, \"weak\": 44, \"signals\": 44, \"returns\": 83, \"negation\": 41, \"single\": 68, \"any\": 42, \"least\": 32, \"one\": 107, \"at\": 32, \"result\": 29, \"low\": 60, \"becomes\": 66, \"exactly\": 47, \"either\": 35, \"signal\": 75, \"inversion\": 38, \"others\": 31, \"universal\": 31, \"generating\": 31, \"more\": 28, \"identity\": 37, \"an\": 37, \"addition\": 35, \"equals\": 40, \"no\": 40, \"must\": 31, \"be\": 31, \"xor\": 24, \"inequality\": 20}", "index_docs": "{\"13\": 455, \"17\": 349, \"4\": 725, \"11\": 470, \"24\": 187, \"43\": 74, \"2\": 1036, \"19\": 340, \"45\": 66, \"12\": 470, \"26\": 271, \"18\": 347, \"71\": 39, \"29\": 232, \"8\": 533, \"9\": 580, \"70\": 39, \"82\": 33, \"16\": 360, \"81\": 33, \"41\": 77, \"22\": 317, \"5\": 587, \"25\": 302, \"76\": 35, \"34\": 121, \"55\": 45, \"14\": 391, \"32\": 140, \"40\": 80, \"15\": 315, \"7\": 664, \"3\": 691, \"21\": 322, \"20\": 333, \"75\": 36, \"10\": 649, \"65\": 40, \"80\": 34, \"53\": 48, \"52\": 48, \"6\": 697, \"77\": 35, \"35\": 113, \"56\": 45, \"94\": 25, \"28\": 245, \"33\": 128, \"27\": 250, \"51\": 58, \"23\": 316, \"37\": 100, \"48\": 62, \"47\": 62, \"30\": 115, \"31\": 143, \"66\": 40, \"67\": 40, \"83\": 33, \"62\": 43, \"61\": 43, \"92\": 28, \"91\": 28, \"60\": 44, \"57\": 44, \"38\": 84, \"58\": 44, \"59\": 44, \"39\": 83, \"64\": 41, \"44\": 68, \"63\": 42, \"85\": 32, \"36\": 107, \"84\": 32, \"90\": 29, \"50\": 60, \"46\": 66, \"54\": 47, \"78\": 35, \"42\": 75, \"72\": 38, \"88\": 31, \"86\": 31, \"87\": 31, \"93\": 28, \"74\": 37, \"73\": 37, \"79\": 35, \"68\": 40, \"69\": 40, \"89\": 31, \"49\": 31, \"95\": 24, \"96\": 20}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"1\", \"3\": \"is\", \"4\": \"logic\", \"5\": \"true\", \"6\": \"the\", \"7\": \"output\", \"8\": \"high\", \"9\": \"input\", \"10\": \"in\", \"11\": \"for\", \"12\": \"gate\", \"13\": \"when\", \"14\": \"a\", \"15\": \"if\", \"16\": \"circuits\", \"17\": \"are\", \"18\": \"inputs\", \"19\": \"this\", \"20\": \"digital\", \"21\": \"practically\", \"22\": \"both\", \"23\": \"boolean\", \"24\": \"0\", \"25\": \"and\", \"26\": \"only\", \"27\": \"of\", \"28\": \"b\", \"29\": \"as\", \"30\": \"or\", \"31\": \"to\", \"32\": \"it\", \"33\": \"inverse\", \"34\": \"logical\", \"35\": \"acts\", \"36\": \"one\", \"37\": \"performs\", \"38\": \"change\", \"39\": \"returns\", \"40\": \"behaves\", \"41\": \"used\", \"42\": \"signal\", \"43\": \"produces\", \"44\": \"single\", \"45\": \"all\", \"46\": \"becomes\", \"47\": \"negated\", \"48\": \"operation\", \"49\": \"be\", \"50\": \"low\", \"51\": \"gives\", \"52\": \"outputs\", \"53\": \"match\", \"54\": \"exactly\", \"55\": \"multiplication\", \"56\": \"detector\", \"57\": \"strengthen\", \"58\": \"weak\", \"59\": \"signals\", \"60\": \"without\", \"61\": \"flips\", \"62\": \"state\", \"63\": \"any\", \"64\": \"negation\", \"65\": \"differ\", \"66\": \"passes\", \"67\": \"directly\", \"68\": \"equals\", \"69\": \"no\", \"70\": \"same\", \"71\": \"level\", \"72\": \"inversion\", \"73\": \"an\", \"74\": \"identity\", \"75\": \"neither\", \"76\": \"combos\", \"77\": \"equal\", \"78\": \"either\", \"79\": \"addition\", \"80\": \"otherwise\", \"81\": \"parity\", \"82\": \"checking\", \"83\": \"except\", \"84\": \"at\", \"85\": \"least\", \"86\": \"universal\", \"87\": \"generating\", \"88\": \"others\", \"89\": \"must\", \"90\": \"result\", \"91\": \"requires\", \"92\": \"produce\", \"93\": \"more\", \"94\": \"equality\", \"95\": \"xor\", \"96\": \"inequality\"}", "word_index": "{\"<OOV>\": 1, \"1\": 2, \"is\": 3, \"logic\": 4, \"true\": 5, \"the\": 6, \"output\": 7, \"high\": 8, \"input\": 9, \"in\": 10, \"for\": 11, \"gate\": 12, \"when\": 13, \"a\": 14, \"if\": 15, \"circuits\": 16, \"are\": 17, \"inputs\": 18, \"this\": 19, \"digital\": 20, \"practically\": 21, \"both\": 22, \"boolean\": 23, \"0\": 24, \"and\": 25, \"only\": 26, \"of\": 27, \"b\": 28, \"as\": 29, \"or\": 30, \"to\": 31, \"it\": 32, \"inverse\": 33, \"logical\": 34, \"acts\": 35, \"one\": 36, \"performs\": 37, \"change\": 38, \"returns\": 39, \"behaves\": 40, \"used\": 41, \"signal\": 42, \"produces\": 43, \"single\": 44, \"all\": 45, \"becomes\": 46, \"negated\": 47, \"operation\": 48, \"be\": 49, \"low\": 50, \"gives\": 51, \"outputs\": 52, \"match\": 53, \"exactly\": 54, \"multiplication\": 55, \"detector\": 56, \"strengthen\": 57, \"weak\": 58, \"signals\": 59, \"without\": 60, \"flips\": 61, \"state\": 62, \"any\": 63, \"negation\": 64, \"differ\": 65, \"passes\": 66, \"directly\": 67, \"equals\": 68, \"no\": 69, \"same\": 70, \"level\": 71, \"inversion\": 72, \"an\": 73, \"identity\": 74, \"neither\": 75, \"combos\": 76, \"equal\": 77, \"either\": 78, \"addition\": 79, \"otherwise\": 80, \"parity\": 81, \"checking\": 82, \"except\": 83, \"at\": 84, \"least\": 85, \"universal\": 86, \"generating\": 87, \"others\": 88, \"must\": 89, \"result\": 90, \"requires\": 91, \"produce\": 92, \"more\": 93, \"equality\": 94, \"xor\": 95, \"inequality\": 96}"}}